Documents/абс_ЗаявкаНаТранспорт/абс_ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТранспорт</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактыОтветственногоМенеджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиКонтрагента</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМоноПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТКНазначения</name>
    <comment>Транспортная компания назначения</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПромежуточный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМиксПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <resources>
    <name>абс_ФайлДопДанных</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДатаАктуальностиКИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_ЗаявкаНаТранспорт/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьИтоговыеРеквизиты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоговыеРеквизиты()
	
	Объект.ВсегоОбъем             = Объект.Товары.Итог("Объем");
	Объект.ВсегоВес               = Объект.Товары.Итог("ВесБрутто"); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуПокупателя(Команда)
	
	Если Объект.Товары.Количество() > 0 
		И Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	ЗаполнитьТоварыПоЗаказуПокупателя_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоЗаказуПокупателя_Сервер()
	
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.Заполнить(Объект.ЗаказПокупателя);
	ЗначениеВРеквизитФормы(ОбъектДок, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьИсториюСтатусовДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсториюСтатусовДокумента()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЭлементыОтбора = СписокИсторияСтатусов.Отбор.Элементы;
		
		Если ЭлементыОтбора.Количество() = 0 Тогда
			ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Иначе
			ЭлементОтбора = ЭлементыОтбора.Получить(0);
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаявкаНаТранспорт");
		ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьИсториюСтатусовДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВесИОбъем()
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока.Объем = РассчитатьОбъемЕдиницыИзмерения(ТекущаяСтрока.ЕдиницаИзмеренияМест) * ТекущаяСтрока.Количество;
		ТекущаяСтрока.ВесБрутто = РассчитатьВесЕдиницыИзмерения(ТекущаяСтрока.ЕдиницаИзмеренияМест) * ТекущаяСтрока.Количество;
	КонецЕСлИ;	
КонецПроцедуры

&НаСервере
Функция РассчитатьВесЕдиницыИзмерения(ЕдИзм)
	Вес=0;
	Если ТипЗнч(ЕдИзм)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		Вес=ЕдИзм.Вес;
	КонецЕсли;
	Возврат Вес;
КонецФункции

&НаСервере
Функция РассчитатьОбъемЕдиницыИзмерения(ЕдИзм)
	Объем=0;
	Если ТипЗнч(ЕдИзм)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		Объем=ЕдИзм.Объем;
	КонецЕсли;
	Возврат Объем;
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьВесИОбъем();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока.ЕдиницаИзмеренияМест = ПолучитьЕдиницуИзмеренияМест(ТекущаяСтрока.Номенклатура);
	КонецЕСли;	
	РассчитатьВесИОбъем();
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмеренияМест(Номенклатура)
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьТЧ();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьТЧ()
	Этаформа.Элементы.Товары.ТолькоПросмотр=Не Объект.ДокументОтгрузки.Пустая();
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиКонтрагентаПриИзменении(Элемент)
	Объект.ТКНазначения=Объект.СпособДоставкиКонтрагента.ТК2;
	//Объект.АдресПромежуточный=абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Объект.ТКНазначения);
	
	//+ Лео ZAA 
	_АдресПром = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Объект.ТКНазначения);
   Объект.АдресПромежуточный = ?(_АдресПром = "",Объект.СпособДоставкиКонтрагента.АдресДоставки,_АдресПром);
	//- Лео ZAA
	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ОбработкаРедактированияАдреса = Обработки.РедактированиеКонтактнойИнформации.Создать();
	//ОбработкаРедактированияАдреса.мВозвратСтруктуры = Истина;	
	//ОбработкаРедактированияАдреса.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента;
	//
	//СтрАдрес = Объект.АдресКонтрагента;
	//СтруктураАдреса = УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(СтрАдрес);
	//УправлениеКонтактнойИнформацией.ЗаполнитьОбъектРедактированияАдресаПоСтруктуре(ОбработкаРедактированияАдреса, СтруктураАдреса);
	//
	//ФормаРедактированияАдреса = ОбработкаРедактированияАдреса.ПолучитьФорму("ФормаЗаписиАдреса", ЭтаФорма);
	//// установим размеры формы для редактирования
	//ФормаРедактированияАдреса.ЭлементыФормы.ПанельНастроекАдреса.Свертка = РежимСверткиЭлементаУправления.Верх;
	//ФормаРедактированияАдреса.ЭлементыФормы.ПанельКомментарий.Свертка = РежимСверткиЭлементаУправления.Низ;
	//ФормаРедактированияАдреса.Высота = 310;
	//
	//РезультатРедактирования = ФормаРедактированияАдреса.ОткрытьМодально();
	//
	//Если РезультатРедактирования = Истина Тогда
	//	СтрАдрес = УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ОбработкаРедактированияАдреса);
	//	Объект.АдресКонтрагента = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдресаПоСтрока(СтрАдрес);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.ОтветственныйМенеджер = Объект.Контрагент.ОсновнойМенеджерПокупателя.ФизЛицо;
	Объект.СпособДоставкиКонтрагента = Объект.Контрагент.абс_ОсновнойСпособДоставки;
	Объект.ТКНазначения = Объект.Контрагент.абс_ОсновнойСпособДоставки.ТК2;
	Объект.АдресПромежуточный=абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Объект.ТКНазначения);
	//Объект.АдресКонтрагента = абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Объект.Контрагент);
	//никитин 08.02.2022  
	//Объект.АдресКонтрагента = абс_ТранспортнаяЛогистика.ПолучитьДоставкиАдресКонтрагента(Объект.Контрагент);
	//
	Объект.БизнесРегион = Объект.Контрагент.Регион;
	Объект.Регион = Объект.БизнесРегион.абс_Регион;
	Объект.Город = Объект.БизнесРегион.абс_Город;
	
	// zhiga {
	// Убоженко, водители путают адрес доставки и везут на адрес Контрагента
	ОсновнойСпособДоставки = Объект.Контрагент.абс_ОсновнойСпособДоставки;
	Если ЗначениеЗаполнено(ОсновнойСпособДоставки) тогда
	Объект.АдресКонтрагента = ?(ЗначениеЗаполнено(ОсновнойСпособДоставки.АдресДоставки),ОсновнойСпособДоставки.АдресДоставки,Объект.АдресКонтрагента);
	КонецЕсли;
	// zhiga }

	
КонецПроцедуры

&НаКлиенте
Процедура ВсегоКоличествоМоноПалетПриИзменении(Элемент)
	
	ПересчитатьКоличествоПалет();
		
КонецПроцедуры

&НаКлиенте
Процедура ВсегоКоличествоМиксПалетПриИзменении(Элемент)
	
	ПересчитатьКоличествоПалет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсегоКоличествоПалетПриИзменении(Элемент)
	
	Если Объект.ВсегоКоличествоМиксПалет=0 И Объект.ВсегоКоличествоМоноПалет=0 Тогда
		Объект.ВсегоКоличествоМоноПалет = Объект.ВсегоКоличествоПалет;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_ЗаявкаНаТранспорт")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
	ЗаполнитьСписокВыбораАдресПромежуточный();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_ЗаявкаНаТранспорт")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКоличествоПалет()
	
	Объект.ВсегоКоличествоПалет = Объект.ВсегоКоличествоМиксПалет + Объект.ВсегоКоличествоМоноПалет;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//+Лно Сафонов Е.А.
	//Не меняем статусы отгрузочных документов
	
	//Если ТекущийОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.ВПути Тогда 
	//	СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.ВПути
	//ИначеЕсли ТекущийОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда 
	//	СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.Закрыт
	//Иначе
	//	СтатусОтгрузки = Неопределено;
	//КонецЕсли;
	//
	//Если Не СтатусОтгрузки = Неопределено Тогда
	//	Если Не ТекущийОбъект.ЗаказПокупателя.Пустая() Тогда
	//		Если СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.Закрыт Тогда
	//			СтатусОтгрузкиДоставлен = Перечисления.абс_СтатусыОтгрузки.Доставлен;
	//			абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(ТекущийОбъект.ЗаказПокупателя, СтатусОтгрузкиДоставлен);
	//		Иначе
	//			абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(ТекущийОбъект.ЗаказПокупателя, СтатусОтгрузки);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	Если Не ТекущийОбъект.ДокументОтгрузки.Пустая() Тогда
	//		абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(ТекущийОбъект.ДокументОтгрузки, СтатусОтгрузки);
	//	КонецЕсли;
	//	
	//	ДокументОснование = ТекущийОбъект.ДокументОснование;
	//	Если ЗначениеЗаполнено(ДокументОснование) и ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
	//		Если ТекущийОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда 
	//			СтатусПеремещения = Перечисления.абс_СтатусыПеремещенийТоваров.Закрыт;
	//		Иначе 
	//			СтатусПеремещения = Перечисления.абс_СтатусыПеремещенийТоваров.Исполнение;
	//		КонецЕсли;
	//		абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(ДокументОснование, СтатусПеремещения);
	//	КонецЕсли;
	//	//если возвращается статус заявки на транспорт, то ставим в заказе покупателя статус "Отгружен".
	//Иначе
	//	Если Не ТекущийОбъект.ЗаказПокупателя.Пустая() Тогда
	//		СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.Отгружен;
	//		абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(ТекущийОбъект.ЗаказПокупателя, СтатусОтгрузки);
	//	КонецЕсли;
	//КонецЕсли;
	
	//-Лно Сафонов Е.А.

КонецПроцедуры

       
&НаКлиенте
Процедура ЗаполнитьПоЗаявкеПоставщику(Команда)
	// Вставить содержимое обработчика.
	Если Объект.Товары.Количество() > 0 
		И Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	//Фильтр = "EXE (*.exe)|*.exe"; 
	//Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "H:\";
	Если Диалог.Выбрать() Тогда

	//сообщить(Диалог.ПолноеИмяФайла);
	ПутьКФайлу=Диалог.ПолноеИмяФайла;
		
	конецесли;
	//Ф=Новый Файл(СокрЛП(Объект.ИмяФайла));
	//Если Ф.Существует()=0 Тогда
	//	Сообщить("Указанный файл не существует!");
	//	Возврат;
	//КонецЕсли;
	//ВыбФайл = Новый Файл(Объект.ИмяФайла);
	//Если ВыбФайл.Существует() Тогда
	//	Объект.РасширениеФайла = ВыбФайл.Расширение;
	//	Объект.ID = ВыбФайл.ИмяБезРасширения;
	//КонецЕсли;

	
	
	
	
	ДвоичныйФайл = ПоместитьВоВременноеХранилище ( Новый ДвоичныеДанные(ПутьКФайлу),ЭтаФорма.УникальныйИдентификатор); 
	
	
	
	
	ЗаполнитьПоЗаявкеПоставщику_Сервер(ДвоичныйФайл);

	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗаявкеПоставщику_Сервер(ДвоичныйФайл)
	ДанныеДокумента = ПолучитьИзВременногоХранилища(ДвоичныйФайл);
	ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" +Объект.Номер + ".xls";
	ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	
	ФайлEXCEL = ИмяФайлаДляЗагрузки ;

	//ИмяФайлаДляЗагрузки = КаталогВременныхФайлов()+"temp" + Объект.ID + Объект.РасширениеФайла;
	//ДанныеДокумента.Записать(ИмяФайлаДляЗагрузки);

	//
	//ФайлEXCEL = ИмяФайлаДляЗагрузки ;
    сообщить(ФайлEXCEL);
	
	
	
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application"); 
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	//ПутьКФайлу="Н:\";
	Книга = Эксель.WorkBooks.Open(ФайлEXCEL);	//ПутьКФайлу
	//сообщить(ПутьКФайлу);
	Лист = Книга.WorkSheets(1);
	ВсегоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
	ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
	Для Строка = 1 По ВсегоСтрок Цикл             
		СтрокаНоменклатура = Объект.товары.Добавить();
        СтрокаНоменклатура.Номенклатура= Лист.Cells(Строка,3).Value;
		СтрокаНоменклатура.Количество= Лист.Cells(Строка,7).Value;
		СтрокаНоменклатура.ЕдиницаИзмерения = Лист.Cells(Строка,6).Value;
	КонецЦикла;
	 	Эксель.Application.Quit();
	
		
КонецПроцедуры

&НаКлиенте
Процедура АдресПромежуточныйПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	//Объект.АдресПромежуточный	=	Элемент.ТекстРедактирования;	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораАдресПромежуточный()
	
	//Элементы.Реквизит3.СписокВыбора.Очистить();
	
	Запрос	=	Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	            	 	|	КонтактнаяИнформация.Объект,
	            	 	|	КонтактнаяИнформация.Тип,
	            	 	|	КонтактнаяИнформация.Вид,
	            	 	|	КонтактнаяИнформация.Представление
	            	 	|ИЗ
	            	 	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	            	 	|ГДЕ
	            	 	|	КонтактнаяИнформация.Объект = &ТКНазначения";
	Запрос.УстановитьПараметр("ТКНазначения", Объект.ТКНазначения);					
	
	Выборка	=	Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Тип= Перечисления.ТипыКонтактнойИнформации.Адрес Тогда	
			Элементы.Реквизит3.СписокВыбора.Добавить(Выборка.Представление);				
		КонецЕсли;				
	КонецЦикла;					
	
КонецПроцедуры	

&НаКлиенте
Процедура ТКНазначенияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьСписокВыбораАдресПромежуточный();
	Объект.АдресПромежуточный	=	"";	
КонецПроцедуры

&НаКлиенте
Процедура Реквизит3ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.АдресПромежуточный	=	ЭтаФорма.Элементы.Реквизит3.ТекстРедактирования;	
КонецПроцедуры
